In [1]:
# ---- Add python/ directory to import path ----
import sys
from pathlib import Path

python_dir = Path().resolve().parent  # points to /python
sys.path.insert(0, str(python_dir))

print("Python path fixed:", python_dir)

Python path fixed: D:\projects\online-shop-2024-analysis\python

In [2]:
from scripts.db_connection import get_mysql_engine

engine = get_mysql_engine()
print(engine)

Engine(mysql+pymysql://root:***@localhost:3306/online_shop_2024)

In [3]:
#Load Data from MySQL (CODE)
import pandas as pd
from scripts.db_connection import get_mysql_engine

engine = get_mysql_engine()

# Load fact and customer dimension
fact_sales = pd.read_sql("SELECT * FROM fact_sales", engine)
dim_customer = pd.read_sql("SELECT * FROM dim_customer", engine)

fact_sales.head()

   order_id  customer_id  product_id     date_id  quantity  revenue
0         1         8002        1896  2024-10-10       4.0   165.18
1         2         5097         534  2024-08-25      10.0  8314.50
2         3         4670        1792  2024-05-21       6.0  1775.76
3         4         3875        1548  2024-06-05      11.0  3916.47
4         5         5507        1270  2024-10-29      11.0  1478.19

In [4]:
# Shape check
fact_sales.shape

# NULL check
fact_sales.isnull().sum()

# Revenue sanity
fact_sales["revenue"].sum()

np.float64(34023125.72)

In [6]:
# Load dimension tables required for enrichment
dim_customer = pd.read_sql("SELECT * FROM dim_customer", engine)
dim_product  = pd.read_sql("SELECT * FROM dim_product", engine)
dim_date     = pd.read_sql("SELECT * FROM dim_date", engine)

print("Dimensions loaded:",
      dim_customer.shape,
      dim_product.shape,
      dim_date.shape)

Dimensions loaded: (10000, 6) (2000, 5) (366, 5)

In [7]:
fact_enriched = (
    fact_sales
        .merge(dim_customer, on="customer_id", how="left")
        .merge(dim_product, on="product_id", how="left")
        .merge(dim_date, on="date_id", how="left")
)

fact_enriched.head()

,order_id,customer_id,product_id,date_id,quantity,revenue,first_name,last_name,email,phone_number,address,product_name,category,catalog_price,supplier_name,year,month,quarter,day_of_week
0,1,8002,1896,2024-10-10,4.0,165.18,Mary,Victoria,mvictoria8002@customer.com,555-703-1044,"949 Port Ave, Sound View, MP",4K Monitor,Electronics,389.19,Unified Trading Co.,2024,10,4,Thursday
1,2,5097,534,2024-08-25,10.0,8314.50,Mary,Bruce,mbruce5097@customer.com,555-427-0088,"222 Sequoia Dr, Lake Town, MN",Air Purifier,Home & Kitchen,840.99,Modern Tech Enterprises,2024,8,3,Sunday
2,3,4670,1792,2024-05-21,6.0,1775.76,Mary,Ruth,mruth4670@customer.com,555-079-7896,"505 Walnut St, Coast City, OR",Electric Kettle,Home & Kitchen,829.03,Reliable Resources Inc.,2024,5,2,Tuesday
3,4,3875,1548,2024-06-05,11.0,3916.47,James,Scott,jscott3875@customer.com,555-702-2796,"949 Port Ave, Sound View, MP",File Cabinet,Furniture,486.95,Advance Dynamics,2024,6,2,Wednesday
4,5,5507,1270,2024-10-29,11.0,1478.19,Mary,Lawrence,mlawrence5507@customer.com,555-924-5621,"888 Beech Rd, Sun City, GA",Wireless Mouse,Electronics,475.59,Quantum Enterprises,2024,10,4,Tuesday

In [8]:
# Ensure date column is datetime
fact_enriched['date_id'] = pd.to_datetime(fact_enriched['date_id'])

fact_enriched[['date_id']].head()

     date_id
0 2024-10-10
1 2024-08-25
2 2024-05-21
3 2024-06-05
4 2024-10-29

In [9]:
#latest transaction date.
analysis_date = fact_enriched['date_id'].max() + pd.Timedelta(days=1)
analysis_date

Timestamp('2024-11-05 00:00:00')

In [10]:
# Calculate RFM metrics at customer level
rfm = (
    fact_enriched
        .groupby('customer_id')
        .agg(
            Recency=('date_id', lambda x: (analysis_date - x.max()).days),
            Frequency=('order_id', 'nunique'),
            Monetary=('revenue', 'sum')
        )
        .reset_index()
)

rfm.head()

   customer_id  Recency  Frequency  Monetary
0            1      187          2   1096.70
1            2      167          1   4378.05
2            3      118          1   3177.20
3            4      156          1    670.56
4            5      335          1   6153.80

In [11]:
rfm.describe()

       customer_id       Recency    Frequency      Monetary
count  10000.00000  10000.000000  10000.00000  10000.000000
mean    5000.50000    168.740200      1.20000   3402.312572
std     2886.89568    104.616365      0.40002   2738.804638
min        1.00000      1.000000      1.00000     24.580000
25%     2500.75000     77.000000      1.00000   1140.450000
50%     5000.50000    162.000000      1.00000   2720.955000
75%     7500.25000    257.000000      1.00000   5049.952500
max    10000.00000    366.000000      2.00000  19651.700000

In [12]:
# Inspect RFM distributions before scoring
rfm[['Recency', 'Frequency', 'Monetary']].describe()

            Recency    Frequency      Monetary
count  10000.000000  10000.00000  10000.000000
mean     168.740200      1.20000   3402.312572
std      104.616365      0.40002   2738.804638
min        1.000000      1.00000     24.580000
25%       77.000000      1.00000   1140.450000
50%      162.000000      1.00000   2720.955000
75%      257.000000      1.00000   5049.952500
max      366.000000      2.00000  19651.700000

In [13]:
# -----------------------------
# RFM Scoring using quantiles
# -----------------------------

# Recency score (lower recency = higher score)
rfm['R_score'] = pd.qcut(
    rfm['Recency'],
    q=5,
    labels=[5, 4, 3, 2, 1]
)

# Frequency score (higher frequency = higher score)
rfm['F_score'] = pd.qcut(
    rfm['Frequency'].rank(method='first'),
    q=5,
    labels=[1, 2, 3, 4, 5]
)

# Monetary score (higher spend = higher score)
rfm['M_score'] = pd.qcut(
    rfm['Monetary'],
    q=5,
    labels=[1, 2, 3, 4, 5]
)

rfm.head()

   customer_id  Recency  Frequency  Monetary R_score F_score M_score
0            1      187          2   1096.70       3       5       2
1            2      167          1   4378.05       3       1       4
2            3      118          1   3177.20       4       1       3
3            4      156          1    670.56       3       1       1
4            5      335          1   6153.80       1       1       5

In [14]:
# Combine individual R, F, M scores into a single RFM score
rfm['RFM_Score'] = (
    rfm['R_score'].astype(str) +
    rfm['F_score'].astype(str) +
    rfm['M_score'].astype(str)
)

rfm[['customer_id', 'RFM_Score']].head()

   customer_id RFM_Score
0            1       352
1            2       314
2            3       413
3            4       311
4            5       115

In [15]:
# Check score distribution
rfm[['R_score', 'F_score', 'M_score']].value_counts().head()

R_score  F_score  M_score
5        5        5          294
4        5        5          247
3        5        5          196
5        5        4          147
2        5        5          147
Name: count, dtype: int64